driver-tests/pojose/fault/caFaultTest/test/testEchoDocLiteral/Output.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <sim:outMessage xmlns:sim="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleDocLiteral">
      <msg>Hello</msg>
    </sim:outMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>