driver-tests/pojose/fault/caFaultTest/src/jbiasa/wsdls/SimpleDocLitFaultMsg.xml

<SOAP_IN-OUT>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleDocLiteral">
   <soapenv:Header/>
   <soapenv:Body>
      <sim:inMessage>
         <msg>Throw</msg>
      </sim:inMessage>
   </soapenv:Body>
</soapenv:Envelope>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <S:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope">
         <faultcode>S:Server</faultcode>
         <faultstring>testing</faultstring>
         <detail>
            <ns2:faultMessage xmlns:ns2="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleDocLiteral">
               <msg>application fault message</msg>
            </ns2:faultMessage>
         </detail>
      </S:Fault>
   </S:Body>
</S:Envelope>
</SOAP_IN-OUT>